In [1]:
import pandas as pd
import numpy as np

## a.타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨

1)20살이 넘으면 성별을 그대로 사용한다.

2)20살 미만이면 성별에 관계없이 “child”라고 한다.

In [2]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [38]:
def male_female_child(r):
    return r.sex if r.age >= 20 else 'child'

titanic['category1'] = titanic.apply(male_female_child, axis=1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male

## b.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

In [39]:
# titanic['age'] = titanic.age.fillna(np.round(titanic.age.mean()))
titanic.age.fillna(np.round(titanic.age.mean()), inplace=True)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

## c.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

In [66]:
df = titanic.groupby(['class','embark_town'])['survived'].count()
df

class   embark_town
First   Cherbourg       85
        Queenstown       2
        Southampton    127
Second  Cherbourg       17
        Queenstown       3
        Southampton    164
Third   Cherbourg       66
        Queenstown      72
        Southampton    353
Name: survived, dtype: int64

In [68]:
df_per1=np.round(df/df.sum() * 100,2)
df_per1

class   embark_town
First   Cherbourg       9.56
        Queenstown      0.22
        Southampton    14.29
Second  Cherbourg       1.91
        Queenstown      0.34
        Southampton    18.45
Third   Cherbourg       7.42
        Queenstown      8.10
        Southampton    39.71
Name: survived, dtype: float64

## d.타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고,

각 그룹별 생존율을 구하시오.

In [41]:
# cut 명령을 사용하면 실수값을 다음처럼 카테고리 값으로 바꿈->categorical 클래스 객체
# bins 인수는 카테고리를 나누는 기준값이 된다. 영역을 넘는 값은 NaN으로 처리
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age.values, bins, labels=labels)
cats

['청년', '중년', '청년', '중년', '중년', ..., '청년', '미성년자', '청년', '청년', '중년']
Length: 891
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [54]:
titanic['나이별승객수'] = cats
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,나이별승객수
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,중년
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,청년
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자
888,0,3,female,30.0,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,청년
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,청년
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,중년

In [63]:
# 그룹별 생존자수
df_s = titanic.groupby(['나이별승객수'])['survived'].count()
df_s

나이별승객수
미성년자    165
청년      407
중년      241
장년       59
노년        5
Name: survived, dtype: int64

In [67]:
# 그룹별 생존율
df_per2=np.round(df_s/df_s.sum() * 100,2)
df_per2

나이별승객수
미성년자    18.81
청년      46.41
중년      27.48
장년       6.73
노년       0.57
Name: survived, dtype: float64

## e.qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.
pd.qcut(): 동일 개수로 나눠서 범주 만들기

In [3]:
#  age_qcut이란 컬럼 만들고 0으로 채움
titanic['age_qcut']=0

In [ ]:
# qcut명령으로 a,b,c로 세 개의 나이 그룹 만듦
titanic['age_qcut']=pd.qcut(titanic.age, q=3, labels=['a','b','c'])
titanic.head()

In [4]:
# 나이 그룹별 남녀 성비
df_age = titanic.groupby(['age_qcut','sex'])['survived'].count()/titanic.groupby(['age_qcut'])['survived'].count()
df_age

age_qcut  sex
0         female    0.352413
          male      0.647587
Name: survived, dtype: float64

In [5]:
# 나이 그룹별 남녀 생존율
df_sur = titanic.groupby(['age_qcut','sex'])['survived'].count()
df_sur

df_sur_p = np.round(df_sur/df_sur.sum() * 100, 2)
df_sur_p

age_qcut  sex
0         female    35.24
          male      64.76
Name: survived, dtype: float64

# a.배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.

In [6]:
import seaborn as sns
mpg = sns.load_dataset('mpg')
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [7]:
mpg['hp_per_cc'] = mpg.horsepower/mpg.displacement
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576

# b.name으로부터 manufacturer(제조사)와 모델을 추출하여 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.

In [8]:
# split method를 이용해 name으로부터 제조사와 모델 추출
sample = mpg['name'].str.split(' ')
sample.head()

0    [chevrolet, chevelle, malibu]
1            [buick, skylark, 320]
2            [plymouth, satellite]
3                [amc, rebel, sst]
4                   [ford, torino]
Name: name, dtype: object

In [9]:
mpg['manufacturer'] = sample.str.get(0)

In [10]:
mpg['model1'] = sample.str.get(1)

In [11]:
mpg['model2'] = sample.str.get(2)
mpg.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manufacturer,model1,model2
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453,chevrolet,chevelle,malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429,buick,skylark,320

In [12]:
mpg['model'] = mpg.model1 + mpg.model2
mpg.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manufacturer,model1,model2,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453,chevrolet,chevelle,malibu,chevellemalibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429,buick,skylark,320,skylark320

In [13]:
mpg.drop(columns=["name", "model1","model2"], inplace=True)
mpg.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevellemalibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark320

# c.엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.

In [14]:
mpg.groupby(['cylinders'])['mpg'].mean()

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

# d.생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.

In [15]:
gr_o = mpg.groupby(['origin']).count()
gr_o

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,hp_per_cc,manufacturer,model
origin,,,,,,,,,,
europe,70,70,70,68,70,70,70,68,70,24
japan,79,79,79,79,79,79,79,79,79,35
usa,249,249,249,245,249,249,249,245,249,138

# e.모델이 5개 이상인 제조사에 대하여 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.

In [16]:
m = mpg.groupby(['manufacturer'])['model'].count()
m.head()

manufacturer
amc         12
audi         2
bmw          0
buick       12
cadillac     0
Name: model, dtype: int64

In [17]:
def model_5(manu):
      return manu >= 5

result = []
for manu in m:
  if model_5(manu):
    result.append(manu)

print(result)

[12, 12, 20, 5, 7, 18, 27, 7, 6, 8, 9, 17, 9, 12, 8]